const geometryQuestions = {
  5: {
    easy: {
      0: [
        {
          question: "Сколько сторон у квадрата?",

          answers: ["2", "3", "4", "5"],

          correct: 2,
        },
      ],
    },

    medium: {
      0: [
        {
          question: "Сколько градусов в прямом угле?",

          answers: ["45", "90", "180", "360"],

          correct: 1,
        },
      ],
    },

    hard: {
      0: [
        {
          question: "Сумма углов треугольника?",

          answers: ["90", "180", "270", "360"],

          correct: 1,
        },
      ],
    },
  },

  6: {
    easy: {
      0: [
        {
          question: "Сколько диагоналей у квадрата?",

          answers: ["1", "2", "3", "4"],

          correct: 1,
        },
      ],
    },

    medium: {
      0: [
        {
          question: "Что измеряют транспортиром?",

          answers: ["Длину", "Угол", "Вес", "Высоту"],

          correct: 1,
        },
      ],
    },

    hard: {
      0: [
        {
          question: "Как называется треугольник с равными сторонами?",

          answers: [
            "Равносторонний",
            "Прямоугольный",
            "Остроугольный",
            "Обычный",
          ],

          correct: 0,
        },
      ],
    },
  },

  7: {
    easy: {
      0: [
        {
          question: "Сколько сторон у пятиугольника?",

          answers: ["4", "5", "6", "7"],

          correct: 1,
        },
      ],
    },

    medium: {
      0: [
        {
          question: "Сколько градусов в развернутом угле?",

          answers: ["90", "180", "270", "360"],

          correct: 1,
        },
      ],
    },

    hard: {
      0: [
        {
          question: "Как называется угол меньше 90°?",

          answers: ["Тупой", "Прямой", "Острый", "Развернутый"],

          correct: 2,
        },
      ],
    },
  },

  8: {
    easy: {
      0: [
        {
          question: "Сколько сторон у шестиугольника?",

          answers: ["5", "6", "7", "8"],

          correct: 1,
        },
      ],
    },

    medium: {
      0: [
        {
          question: "Что такое радиус круга?",

          answers: ["Диаметр", "Половина диаметра", "Сторона", "Высота"],

          correct: 1,
        },
      ],
    },

    hard: {
      0: [
        {
          question: "Сколько градусов имеет полный круг?",

          answers: ["90", "180", "270", "360"],

          correct: 3,
        },
      ],
    },
  },
};
