const logicQuestions = {
  5: {
    easy: {
      0: [
        {
          question: "Что тяжелее: килограмм железа или килограмм ваты?",

          answers: ["Железо", "Вата", "Одинаково", "Не знаю"],

          correct: 2,
        },
      ],
    },

    medium: {
      0: [
        {
          question: "Продолжите: 2, 4, 6, 8 ...",

          answers: ["9", "10", "11", "12"],

          correct: 1,
        },
      ],
    },

    hard: {
      0: [
        {
          question: "Сколько месяцев имеют 28 дней?",

          answers: ["1", "2", "6", "12"],

          correct: 3,
        },
      ],
    },
  },

  6: {
    easy: {
      0: [
        {
          question: "Что идет после среды?",

          answers: ["Вторник", "Четверг", "Пятница", "Суббота"],

          correct: 1,
        },
      ],
    },

    medium: {
      0: [
        {
          question: "Продолжите: 5, 10, 15, 20 ...",

          answers: ["21", "22", "25", "30"],

          correct: 2,
        },
      ],
    },

    hard: {
      0: [
        {
          question: "Что больше: 150 или 105?",

          answers: ["105", "150", "Одинаково", "Не знаю"],

          correct: 1,
        },
      ],
    },
  },

  7: {
    easy: {
      0: [
        {
          question: "Что идет после пятницы?",

          answers: ["Четверг", "Суббота", "Воскресенье", "Понедельник"],

          correct: 1,
        },
      ],
    },

    medium: {
      0: [
        {
          question: "Продолжите: 3, 6, 9, 12 ...",

          answers: ["13", "14", "15", "16"],

          correct: 2,
        },
      ],
    },

    hard: {
      0: [
        {
          question: "Сколько будет 5 + 5 × 0 ?",

          answers: ["0", "5", "10", "50"],

          correct: 1,
        },
      ],
    },
  },
};
